payment_ebizcharge/models/payment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ebiz="http://eBizCharge.ServiceModel.SOAP">
   <soapenv:Header/>
   <soapenv:Body>
      <ebiz:runCustomerTransaction>
         <!--Optional:-->
         <ebiz:securityToken>
            <!--Optional:-->
            <ebiz:SecurityId>0814c940-5ea6-425e-8343-994c126caa13</ebiz:SecurityId>
            <!--Optional:-->
            <ebiz:UserId>odoo1</ebiz:UserId>
            <!--Optional:-->
            <ebiz:Password>odoo1</ebiz:Password>
         </ebiz:securityToken>
         <!--Optional:-->
         <ebiz:custNum>11430264</ebiz:custNum>
         <!--Optional:-->
         <ebiz:paymentMethodID>1729</ebiz:paymentMethodID>
         <!--Optional:-->
         <ebiz:tran>
            <ebiz:isRecurring>false</ebiz:isRecurring>
            <!--Optional:-->
            
            <ebiz:IgnoreDuplicate>true</ebiz:IgnoreDuplicate>
            <!--Optional:-->
            <ebiz:Details>
               <ebiz:NonTax>false</ebiz:NonTax>
               <ebiz:Tax>0.0</ebiz:Tax>
               <!--Optional:-->
               
               <ebiz:Subtotal>1349</ebiz:Subtotal>
               <ebiz:Shipping>0</ebiz:Shipping>
               <!--Optional:-->
               <ebiz:ShipFromZip>54000</ebiz:ShipFromZip>
               <!--Optional:-->
               
               <!--Optional:-->
               <ebiz:PONum>S00026</ebiz:PONum>
               <!--Optional:-->
               <ebiz:OrderID>S00026</ebiz:OrderID>
               <!--Optional:-->
               <ebiz:Invoice>S00026</ebiz:Invoice>
               
               <ebiz:Discount>0</ebiz:Discount>
               <!--Optional:-->
               <ebiz:Comments>Heelo</ebiz:Comments>
               <!--Optional:-->
               <ebiz:Description>description</ebiz:Description>
               <!--Optional:-->
               <ebiz:Currency>USD</ebiz:Currency>
               <!--Optional:-->
               
               <ebiz:Amount>1349</ebiz:Amount>
               <ebiz:AllowPartialAuth>false</ebiz:AllowPartialAuth>
               <!--Optional:-->
               <ebiz:Duty>0</ebiz:Duty>
               <ebiz:Tip>0</ebiz:Tip>
            </ebiz:Details>
            <!--Optional:-->
            
            <!--Optional:-->
            
            <!--Optional:-->
            <ebiz:Software>Odoo</ebiz:Software>
            <ebiz:MerchReceipt>true</ebiz:MerchReceipt>
            <!--Optional:-->
            <ebiz:CustReceiptName></ebiz:CustReceiptName>
            <!--Optional:-->
            <ebiz:CustReceiptEmail>kuldeep.k@tekhqs.com</ebiz:CustReceiptEmail>
            <ebiz:CustReceipt>false</ebiz:CustReceipt>
            <!--Optional:-->
            
            <!--Optional:-->
            <ebiz:ClientIP>203.81.235.76</ebiz:ClientIP>
            <!--Optional:-->
            <ebiz:CardCode>999</ebiz:CardCode>
            <!--Optional:-->
            <ebiz:Command>sale</ebiz:Command>
            <!--Optional:-->
            <ebiz:LineItems>
               <!--Zero or more repetitions:-->
               <ebiz:LineItem>
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  <ebiz:SKU>Test</ebiz:SKU>
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  <ebiz:ProductName>Large Desk</ebiz:ProductName>
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  <ebiz:UnitPrice>1349</ebiz:UnitPrice>
                  <!--Optional:-->
                  <ebiz:Qty>1</ebiz:Qty>
                  <ebiz:Taxable>false</ebiz:Taxable>
                  <!--Optional:-->
                  <ebiz:TaxAmount>0.0</ebiz:TaxAmount>
               </ebiz:LineItem>
            </ebiz:LineItems>
         </ebiz:tran>
      </ebiz:runCustomerTransaction>
   </soapenv:Body>
</soapenv:Envelope>



<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ebiz="http://eBizCharge.ServiceModel.SOAP">
   <soapenv:Header/>
   <soapenv:Body>
      <ebiz:runTransaction>
         <!--Optional:-->
         <ebiz:securityToken>
            <!--Optional:-->
            <ebiz:SecurityId>0814c940-5ea6-425e-8343-994c126caa13</ebiz:SecurityId>
            <!--Optional:-->
            <ebiz:UserId>odoo1</ebiz:UserId>
            <!--Optional:-->
            <ebiz:Password>odoo1</ebiz:Password>
         </ebiz:securityToken>
         <!--Optional:-->
         <ebiz:tran>
            <!--Optional:-->
            
            <!--Optional:-->
            
            <!--Optional:-->
      <ebiz:LineItems>
               <!--Zero or more repetitions:-->
               <ebiz:LineItem>
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  <ebiz:SKU>Test</ebiz:SKU>
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  <ebiz:ProductName>Large Desk</ebiz:ProductName>
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  
                  <!--Optional:-->
                  <ebiz:UnitPrice>1349</ebiz:UnitPrice>
                  <!--Optional:-->
                  <ebiz:Qty>1</ebiz:Qty>
                  <ebiz:Taxable>false</ebiz:Taxable>
                  <!--Optional:-->
                  <ebiz:TaxAmount>0.0</ebiz:TaxAmount>
               </ebiz:LineItem>
            </ebiz:LineItems>
            <ebiz:IsRecurring>false</ebiz:IsRecurring>
            <!--Optional:-->
            
            <ebiz:IgnoreDuplicate>false</ebiz:IgnoreDuplicate>
            <!--Optional:-->
            
            <!--Optional:-->
            <ebiz:Details>
               <ebiz:NonTax>false</ebiz:NonTax>
               <ebiz:Tax>0.0</ebiz:Tax>
               <!--Optional:-->
               
               <ebiz:Subtotal>1349</ebiz:Subtotal>
               <ebiz:Shipping>0</ebiz:Shipping>
               <!--Optional:-->
               <ebiz:ShipFromZip>54000</ebiz:ShipFromZip>
               <!--Optional:-->
               
               <!--Optional:-->
               <ebiz:PONum>S00026</ebiz:PONum>
               <!--Optional:-->
               <ebiz:OrderID>S00026</ebiz:OrderID>
               <!--Optional:-->
               <ebiz:Invoice>S00026</ebiz:Invoice>
               
               <ebiz:Discount>0</ebiz:Discount>
               <!--Optional:-->
               <ebiz:Comments>Heelo</ebiz:Comments>
               <!--Optional:-->
               <ebiz:Description>description</ebiz:Description>
               <!--Optional:-->
               <ebiz:Currency>USD</ebiz:Currency>
               <!--Optional:-->
               
               <ebiz:Amount>1349</ebiz:Amount>
               <ebiz:AllowPartialAuth>false</ebiz:AllowPartialAuth>
               <!--Optional:-->
               <ebiz:Duty>0</ebiz:Duty>
               <ebiz:Tip>0</ebiz:Tip>
            </ebiz:Details>
            <!--Optional:-->
            <!--Optional:-->
            <ebiz:Software>Odoo</ebiz:Software>
            <ebiz:MerchReceipt>true</ebiz:MerchReceipt>
            <!--Optional:-->
            <ebiz:CustReceiptName></ebiz:CustReceiptName>
            <!--Optional:-->
            <ebiz:CustReceiptEmail>kuldeep.k@tekhqs.com</ebiz:CustReceiptEmail>
            <ebiz:CustReceipt>false</ebiz:CustReceipt>
            <!--Optional:-->
            
            <!--Optional:-->
            <ebiz:CreditCardData>
               <!--Optional:-->
               
               <!--Optional:-->
               
               <!--Optional:-->
               
               <!--Optional:-->
               
               <ebiz:InternalCardAuth>false</ebiz:InternalCardAuth>
               <!--Optional:-->
               
               <!--Optional:-->
               
               <!--Optional:-->
               
               <!--Optional:-->
               
               <ebiz:CardPresent>true</ebiz:CardPresent>
               <!--Optional:-->
               <ebiz:CardNumber>4000100711112227</ebiz:CardNumber>
               <!--Optional:-->
               <ebiz:CardExpiration>0922</ebiz:CardExpiration>
               <!--Optional:-->
               <ebiz:CardCode>999</ebiz:CardCode>
               <!--Optional:-->
               <ebiz:AvsZip>54000</ebiz:AvsZip>
               <!--Optional:-->
               <ebiz:AvsStreet>St # 10</ebiz:AvsStreet>
               <!--Optional:-->
               
               <!--Optional:-->
               
            </ebiz:CreditCardData>
            <!--Optional:-->
            <ebiz:Command>Sale</ebiz:Command>
            <!--Optional:-->
            
            <!--Optional:-->
            
            <!--Optional:-->
            
            <!--Optional:-->
            
            <!--Optional:-->
            <ebiz:AccountHolder>Frank</ebiz:AccountHolder>
            <!--Optional:-->
            
            
         </ebiz:tran>
      </ebiz:runTransaction>
   </soapenv:Body>
</soapenv:Envelope>

        # resp = {
        #     'CustNum': '0',
        #     'ResultCode': 'A',
        #     'Result': 'Approved',
        #     'RemainingBalance': 0.0,
        #     'RefNum': '3118558459',
        #     'ProfilerReason': None,
        #     'ProfilerResponse': None,
        #     'ProfilerScore': None,
        #     'Payload': None,
        #     'isDuplicate': False,
        #     'ErrorCode': '0',
        #     'Error': 'Approved',
        #     'VpasResultCode': None,
        #     'ConvertedAmountCurrency': '840',
        #     'ConvertedAmount': 0.0,
        #     'ConversionRate': 0.0,
        #     'CardLevelResultCode': 'A',
        #     'CardLevelResult': 'Visa Traditional',
        #     'CardCodeResultCode': 'M',
        #     'CardCodeResult': 'Match',
        #     'BatchRefNum': '428422',
        #     'BatchNum': '1',
        #     'AvsResultCode': 'NNN',
        #     'AvsResult': 'Address: No Match & 5 Digit Zip: No Match',
        #     'AuthCode': '435133',
        #     'AuthAmount': 0.05,
        #     'AcsUrl': None,
        #     'Status': 'Pending',
        #     'StatusCode': 'P'
        # }


<soapenv:Envelope
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:ebiz="http://eBizCharge.ServiceModel.SOAP">
  <soapenv:Header/>
  <soapenv:Body>
    <ebiz:runCustomerTransaction>
      <ebiz:securityToken>
        <ebiz:SecurityId>BF2A208F-794B-4CEE-B4DF-6318A4007523</ebiz:SecurityId>
        <ebiz:UserId>businesscentral1</ebiz:UserId>
        <ebiz:Password>businesscentral1</ebiz:Password>
      </ebiz:securityToken>
      <ebiz:custNum>11254154</ebiz:custNum>
      <ebiz:paymentMethodID>954</ebiz:paymentMethodID>
      <ebiz:tran>
        <ebiz:isRecurring>0</ebiz:isRecurring>
        <ebiz:InventoryLocation></ebiz:InventoryLocation>
        <ebiz:IgnoreDuplicate>0</ebiz:IgnoreDuplicate>
        <ebiz:Details>
          <ebiz:NonTax>1</ebiz:NonTax>
          <ebiz:Tax>57.03</ebiz:Tax>
          <ebiz:Table></ebiz:Table>
          <ebiz:Subtotal>950.50</ebiz:Subtotal>
          <ebiz:Shipping>0</ebiz:Shipping>
          <ebiz:ShipFromZip>31772</ebiz:ShipFromZip>
          <ebiz:SessionID></ebiz:SessionID>
          <ebiz:PONum></ebiz:PONum>
          <ebiz:OrderID>S-RETORD20020</ebiz:OrderID>
          <ebiz:Invoice>PS-CR104067</ebiz:Invoice>
          <ebiz:Duty>0</ebiz:Duty>
          <ebiz:Discount>0</ebiz:Discount>
          <ebiz:Comments></ebiz:Comments>
          <ebiz:Description></ebiz:Description>
          <ebiz:Currency></ebiz:Currency>
          <ebiz:Clerk></ebiz:Clerk>
          <ebiz:Amount>1007.53</ebiz:Amount>
          <ebiz:AllowPartialAuth>0</ebiz:AllowPartialAuth>
          <ebiz:Terminal></ebiz:Terminal>
          <ebiz:Tip>0</ebiz:Tip>
        </ebiz:Details>
        <ebiz:MerchReceiptName></ebiz:MerchReceiptName>
        <ebiz:MerchReceiptEmail></ebiz:MerchReceiptEmail>
        <ebiz:Software></ebiz:Software>
        <ebiz:MerchReceipt>0</ebiz:MerchReceipt>
        <ebiz:CustReceiptName></ebiz:CustReceiptName>
        <ebiz:CustReceiptEmail></ebiz:CustReceiptEmail>
        <ebiz:CustReceipt>0</ebiz:CustReceipt>
        <ebiz:ClientIP></ebiz:ClientIP>
        <ebiz:CardCode></ebiz:CardCode>
        <ebiz:Command>CREDIT</ebiz:Command>
        <ebiz:LineItems>
          <ebiz:LineItem>
            <ebiz:SKU>2000-S</ebiz:SKU>
            <ebiz:ProductName>SYDNEY Swivel Chair, green</ebiz:ProductName>
            <ebiz:Description></ebiz:Description>
            <ebiz:UnitOfMeasure>Piece</ebiz:UnitOfMeasure>
            <ebiz:UnitPrice>190.10</ebiz:UnitPrice>
            <ebiz:Qty>5</ebiz:Qty>
            <ebiz:Taxable>1</ebiz:Taxable>
            <ebiz:TaxAmount>0</ebiz:TaxAmount>
          </ebiz:LineItem>
        </ebiz:LineItems>
      </ebiz:tran>
    </ebiz:runCustomerTransaction>
  </soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:ebiz="http://eBizCharge.ServiceModel.SOAP">
  <soapenv:Header/>
  <soapenv:Body>
    <ebiz:AddInvoice>
      <ebiz:securityToken>
        <ebiz:SecurityId>BF2A208F-794B-4CEE-B4DF-6318A4007523</ebiz:SecurityId>
        <ebiz:UserId>businesscentral1</ebiz:UserId>
        <ebiz:Password>businesscentral1</ebiz:Password>
      </ebiz:securityToken>
      <ebiz:invoice>
        <ebiz:MerchantId></ebiz:MerchantId>
        <ebiz:CustomerId>50000</ebiz:CustomerId>
        <ebiz:SubCustomerId></ebiz:SubCustomerId>
        <ebiz:InvoiceNumber>PS-CR104010</ebiz:InvoiceNumber>
        <ebiz:InvoiceInternalId></ebiz:InvoiceInternalId>
        <ebiz:InvoiceDate>2021-04-12</ebiz:InvoiceDate>
        <ebiz:Currency></ebiz:Currency>
        <ebiz:InvoiceAmount>-2934.29</ebiz:InvoiceAmount>
        <ebiz:InvoiceDueDate>2021-04-12</ebiz:InvoiceDueDate>
        <ebiz:AmountDue>-2934.29</ebiz:AmountDue>
        <ebiz:Items>
          <ebiz:Item>
            <ebiz:ItemId>1908-S</ebiz:ItemId>
            <ebiz:Name>Armless swivel chair, blue</ebiz:Name>
            <ebiz:Description>Armless swivel chair, blue</ebiz:Description>
            <ebiz:UnitPrice>-190.1</ebiz:UnitPrice>
            <ebiz:Qty>10</ebiz:Qty>
            <ebiz:Taxable>1</ebiz:Taxable>
            <ebiz:TaxRate>0</ebiz:TaxRate>
            <ebiz:UnitOfMeasure>Piece</ebiz:UnitOfMeasure>
            <ebiz:TotalLineAmount>-1901</ebiz:TotalLineAmount>
            <ebiz:TotalLineTax>0</ebiz:TotalLineTax>
            <ebiz:ItemLineNumber>10000</ebiz:ItemLineNumber>
          </ebiz:Item>
          <ebiz:Item>
            <ebiz:ItemId>1906-S</ebiz:ItemId>
            <ebiz:Name>ATHENS Mobile Pedestal</ebiz:Name>
            <ebiz:Description>ATHENS Mobile Pedestal</ebiz:Description>
            <ebiz:UnitPrice>-433.6</ebiz:UnitPrice>
            <ebiz:Qty>2</ebiz:Qty>
            <ebiz:Taxable>1</ebiz:Taxable>
            <ebiz:TaxRate>0</ebiz:TaxRate>
            <ebiz:UnitOfMeasure>Piece</ebiz:UnitOfMeasure>
            <ebiz:TotalLineAmount>-867.2</ebiz:TotalLineAmount>
            <ebiz:TotalLineTax>0</ebiz:TotalLineTax>
            <ebiz:ItemLineNumber>20000</ebiz:ItemLineNumber>
          </ebiz:Item>
        </ebiz:Items>
        <ebiz:TotalTaxAmount>-166.09</ebiz:TotalTaxAmount>
        <ebiz:NotifyCustomer>0</ebiz:NotifyCustomer>
        <ebiz:InvoiceURL></ebiz:InvoiceURL>
        <ebiz:InvoiceSalesRepId></ebiz:InvoiceSalesRepId>
        <ebiz:InvoiceIsToBeEmailed>1</ebiz:InvoiceIsToBeEmailed>
        <ebiz:InvoiceIsToBePrinted>1</ebiz:InvoiceIsToBePrinted>
        <ebiz:InvoiceLastSyncDateTime></ebiz:InvoiceLastSyncDateTime>
      </ebiz:invoice>
    </ebiz:AddInvoice>
  </soapenv:Body>
</soapenv:Envelope>
4:11
<soapenv:Envelope
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:ebiz="http://eBizCharge.ServiceModel.SOAP">
  <soapenv:Header/>
  <soapenv:Body>
    <ebiz:AddInvoice>
      <ebiz:securityToken>
        <ebiz:SecurityId>BF2A208F-794B-4CEE-B4DF-6318A4007523</ebiz:SecurityId>
        <ebiz:UserId>businesscentral1</ebiz:UserId>
        <ebiz:Password>businesscentral1</ebiz:Password>
      </ebiz:securityToken>
      <ebiz:invoice>
        <ebiz:MerchantId></ebiz:MerchantId>
        <ebiz:CustomerId>50000</ebiz:CustomerId>
        <ebiz:SubCustomerId></ebiz:SubCustomerId>
        <ebiz:InvoiceNumber>G04005</ebiz:InvoiceNumber>
        <ebiz:InvoiceInternalId></ebiz:InvoiceInternalId>
        <ebiz:InvoiceDate>2021-04-12</ebiz:InvoiceDate>
        <ebiz:Currency></ebiz:Currency>
        <ebiz:InvoiceAmount>-58.00</ebiz:InvoiceAmount>
        <ebiz:InvoiceDueDate>2021-04-12</ebiz:InvoiceDueDate>
        <ebiz:AmountDue>-58</ebiz:AmountDue>
        <ebiz:Items>
          <ebiz:Item>
            <ebiz:ItemId>CREDIT MEMO</ebiz:ItemId>
            <ebiz:Name>CREDIT MEMO</ebiz:Name>
            <ebiz:Description>CREDIT MEMO</ebiz:Description>
            <ebiz:UnitPrice>-58.00</ebiz:UnitPrice>
            <ebiz:Qty>1</ebiz:Qty>
            <ebiz:Taxable>0</ebiz:Taxable>
            <ebiz:TaxRate>0</ebiz:TaxRate>
            <ebiz:UnitOfMeasure></ebiz:UnitOfMeasure>
            <ebiz:TotalLineAmount>-58.00</ebiz:TotalLineAmount>
            <ebiz:TotalLineTax>0</ebiz:TotalLineTax>
            <ebiz:ItemLineNumber>1</ebiz:ItemLineNumber>
          </ebiz:Item>
        </ebiz:Items>
        <ebiz:NotifyCustomer>0</ebiz:NotifyCustomer>
        <ebiz:InvoiceURL></ebiz:InvoiceURL>
        <ebiz:InvoiceSalesRepId></ebiz:InvoiceSalesRepId>
        <ebiz:InvoiceIsToBeEmailed>1</ebiz:InvoiceIsToBeEmailed>
        <ebiz:InvoiceIsToBePrinted>1</ebiz:InvoiceIsToBePrinted>
        <ebiz:InvoiceLastSyncDateTime></ebiz:InvoiceLastSyncDateTime>
      </ebiz:invoice>
    </ebiz:AddInvoice>
  </soapenv:Body>
</soapenv:Envelope>



{
    'MerchantId': None,
    'CustomerId': '32',
    'SubCustomerId': None,
    'DivisionId': None,
    'InvoiceNumber': 'INV/2021/0163',
    'InvoiceInternalId': '1367eeb3-2dd5-4ffe-a229-4151235f07d4',
    'InvoiceDate': '2021-06-25',
    'InvoiceDueDate': '2021-06-25',
    'PoNum': None,
    'SoNum': None,
    'InvoiceAmount': '30.0000',
    'AmountDue': '-30.0000',
    'Currency': None,
    'AuthCode': '249359',
    'RefNum': '3123316707',
    'Last4': '2224',
    'PaymentMethod': 'Visa',
    'DatePaid': '2021-07-02T06:05:19',
    'PaidAmount': '30.0000',
    'PaymentInternalId': '534b2840-44e2-41c3-b526-736306a05a50',
    'ScheduledPaymentInternalId': None,
    'PaymentRequestDateTime': None,
    'CustNum': '11495241',
    'PaymentMethodId': '115',
    'PaymentType': 'InvoicePayment',
    'TypeId': 'Invoice',
    'PaymentSourceId': None,
    'TransactionLookupKey': None,
    'ExternalTxnId': None,
    'Description': None,
    'CustomerEmailAddress': None,
    'DocumentTypeId': None,
    'OrderId': None
}